# Alex Kennedy
## Week 13 Python pandas Grouping and mapping

In [2]:
import numpy as np 
from pandas import Series,DataFrame
import pandas as pd

In [3]:
df = DataFrame({'city':['Alma','Fox Park','Louisville','LakeMary'],'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1    Fox Park      9800
2  Louisville      9062
3    LakeMary      8966

In [4]:
st_map={'Alma':'Colorado','Fox Park':'Utah','Louisville':'Colorado','LakeMary':'California'}

In [5]:
st_map

{'Alma': 'Colorado',
 'Fox Park': 'Utah',
 'Louisville': 'Colorado',
 'LakeMary': 'California'}

In [6]:
df['state']=df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1    Fox Park      9800        Utah
2  Louisville      9062    Colorado
3    LakeMary      8966  California

In [12]:
#apply
def meter(x):
    return x/3.3808

In [13]:
df['altitude'] =df['altitude'].apply(meter)
df

         city     altitude       state
0        Alma  3062.884524    Colorado
1    Fox Park  2898.722196        Utah
2  Louisville  2680.430667    Colorado
3    LakeMary  2652.035021  California

In [16]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['UT','OH','TX','OR'])

In [15]:
df

         city     altitude       state
0        Alma  3062.884524    Colorado
1    Fox Park  2898.722196        Utah
2  Louisville  2680.430667    Colorado
3    LakeMary  2652.035021  California

In [22]:
def dif(x):
    return x.max() - x.min()

In [23]:
df.apply(dif)

b    2.564397
d    2.817436
e    1.813740
dtype: float64

In [24]:
df.apply(dif, axis=1)

UT    1.408695
OH    1.655020
TX    3.219806
OR    1.024898
dtype: float64

In [25]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-2.325112  1.0  0.0  0.0
-1.785586  0.0  1.0  0.0
-0.919046  0.0  0.0  1.0
-0.268353  1.0  0.0  0.0
-0.130566  0.0  0.0  1.0
 0.006951  0.0  0.0  1.0
 0.019818  1.0  0.0  0.0
 0.239285  1.0  0.0  0.0
 0.341348  0.0  1.0  0.0
 0.489649  0.0  1.0  0.0
 0.894694  0.0  0.0  1.0
 1.031849  0.0  1.0  0.0

In [30]:
#groupby
df= DataFrame({'k1':['a','a','b','b','a'],
              'k1':['one','two','one','two','one'],
              'dataset1': np.random.randn(5),
              'dataset2': np.random.rand(5)})

In [31]:
df

    k1  dataset1  dataset2
0  one  0.918428  0.177929
1  two  1.196108  0.793955
2  one -0.406994  0.736135
3  two  1.239425  0.704597
4  one  0.380714  0.535461

In [32]:
df.groupby('k1').count()

     dataset1  dataset2
k1
one         3         3
two         2         2